app/Controllers/Gawe.php

    public function index()
    {
        $builder = $this->db->table('gawe');
        $query   = $builder->get()->getResult();
---
SELECT *
FROM `gawe`